package com.dxy.mapper;

import com.dxy.data.DPSPZL;
import org.apache.ibatis.annotations.Insert;
import org.apache.ibatis.annotations.Select;

public interface DPSPZLMapper {
    @Insert("INSERT INTO 多多店铺商品资料(`商品名称`,`商品ID`,`店铺名称`,`商品编码`,`商品链接`,`商品ID1`,`库存`,`累计销量`,`_30日销量`,`资源位`,`活动价`,`erp编码`,`图片`,`成本`,`全网价格_持续更新_`,`百亿资源位失效`,`百亿基础价`,`细分属性`,`属性分类`,`男女分类`,`新款_动销款_清仓款`,`季节`,`供应商`,`_24年款式店铺定位`,`满两件折扣`,`活动ID`,`新客立减_元_`,`惊喜券`,`商品立减券`,`类目名称`,`类目全称`,`拼团价`,`单买价`,`参考价`,`收藏数`,`创建时间`,`商品状态`,`_1件实收最低场景商家预估实收价格`,`_2件实收最低场景商家预估实收价格`,`券前价`,`价格类型`,`商家出资常规优惠额度`,`商家出资常规优惠`,`是否预售`)VALUES(#{商品名称} ,#{商品ID} ,#{店铺名称} ,#{商品编码} ,#{商品链接} ,#{商品ID1} ,#{库存} ,#{累计销量} ,#{_30日销量} ,#{资源位} ,#{活动价} ,#{erp编码} ,#{图片} ,#{成本} ,#{全网价格_持续更新_} ,#{百亿资源位失效} ,#{百亿基础价} ,#{细分属性} ,#{属性分类} ,#{男女分类} ,#{新款_动销款_清仓款} ,#{季节} ,#{供应商} ,#{_24年款式店铺定位} ,#{满两件折扣} ,#{活动ID} ,#{新客立减_元_} ,#{惊喜券} ,#{商品立减券} ,#{类目名称} ,#{类目全称} ,#{拼团价} ,#{单买价} ,#{参考价} ,#{收藏数} ,#{创建时间} ,#{商品状态} ,#{_1件实收最低场景商家预估实收价格} ,#{_2件实收最低场景商家预估实收价格} ,#{券前价} ,#{价格类型} ,#{商家出资常规优惠额度} ,#{商家出资常规优惠} ,#{是否预售}  )")
    int insert(DPSPZL e);

    @Select("SELECT * FROM 多多店铺商品资料 WHERE id = #{id}")
    DPSPZL selectById(Long id);
}
